Tekla.Structures.Analysis.AnalysisPartSpanningProperties.SpanningTypeEnum
The spanning types.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties.SpanningTypeEnum.SPANNING_TYPE_SINGLE
The single spanning type.

Tekla.Structures.Analysis.AnalysisPartSpanningProperties.SpanningTypeEnum.SPANNING_TYPE_DOUBLE
The double spanning type.